Процедура ЗаполнитьПоБункерам() Экспорт

	Если Не ЗначениеЗаполнено(Автомат) Тогда
		ВызватьИсключение "Не заполнен автомат.";
	КонецЕсли;

	Товары.Очистить();

	Для Каждого Бункер Из Автомат.Бункеры Цикл

		Если Не ЗначениеЗаполнено(Бункер.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.НомерБункера  = Бункер.НомерБункера;
		НоваяСтрока.Номенклатура  = Бункер.Номенклатура;
		НоваяСтрока.Количество    = Бункер.Вместимость;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ОстаткиНаСкладе.Записывать   = Истина;
	Движения.ОстаткиВАвтоматах.Записывать = Истина;

	Для Каждого Строка Из Товары Цикл

		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Движение.Период       = Дата;
		Движение.Склад        = Склад;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество   = Строка.Количество;

		Движение = Движения.ОстаткиВАвтоматах.Добавить();
		Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
		Движение.Период       = Дата;
		Движение.Автомат      = Автомат;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Количество   = Строка.Количество;
		Движение.ГоденДо      = Строка.ГоденДо;

	КонецЦикла;

	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрНакопления.ОстаткиНаСкладе");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.ИсточникДанных = Товары;
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Элемент.УстановитьЗначение("Склад", Склад);
	Блокировка.Заблокировать();

	Движения.ОстаткиНаСкладе.Записать();

	Если Константы.КонтролироватьОстатки.Получить() Тогда
		ВендингСервер.ПроверитьОтрицательныеОстатки(
			"ОстаткиНаСкладе", "Склад", Склад, Ссылка, МоментВремени(), Отказ);
	КонецЕсли;

КонецПроцедуры