Процедура ПередЗаписью(Отказ)

	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Код) Тогда
		УстановитьНовыйКод();
	КонецЕсли;

	Если ЗначениеЗаполнено(Локация) Тогда
		Наименование = СтрШаблон("Автомат №%1 — %2", Формат(Код, "ЧГ=0"), Локация.Наименование);
	Иначе
		Наименование = СтрШаблон("Автомат №%1", Формат(Код, "ЧГ=0"));
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ВстреченныеНомера = Новый Соответствие;

	Для Каждого Строка Из Бункеры Цикл

		Если ВстреченныеНомера[Строка.НомерБункера] <> Неопределено Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Бункер №%1 указан больше одного раза.", Строка.НомерБункера);
			Сообщение.Поле  = СтрШаблон("Бункеры[%1].НомерБункера", Бункеры.Индекс(Строка));
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

			Отказ = Истина;

		КонецЕсли;

		ВстреченныеНомера.Вставить(Строка.НомерБункера, Истина);

	КонецЦикла;

КонецПроцедуры